import React from 'react'

export const Day1 = React.memo(() => (
  <React.Fragment>
    <tr>
      <td>08:00 - 09:30</td>
      <td>พิธีการ</td>
      <td>คณะกรรมการกลางงานกิจกรรมพัฒนาผู้เรียน</td>
    </tr>
    <tr>
      <td> - </td>
      <td>การแสดงนาฏศิลป์</td>
      <td>ชมรมนาฏศิลป์</td>
    </tr>
    <tr>
      <td> - </td>
      <td>การแสดงลีลาศ</td>
      <td>กลุ่มสาระสุขศึกษาและพลศึกษา</td>
    </tr>
    <tr>
      <td> - </td>
      <td>การแสดงดุริยางค์</td>
      <td>ชมรมดุริยางค์</td>
    </tr>
    <tr>
      <td> - </td>
      <td>การแสดงดนตรีไทย</td>
      <td>ชมรมดนตรีไทย</td>
    </tr>
    <tr>
      <td>09:30 - 09:40</td>
      <td>พิธีกรแนะนำงาน</td>
      <td>คณะกรรมการกลางงานกิจกรรมพัฒนาผู้เรียน</td>
    </tr>
    <tr>
      <td>09:40 - 09:50</td>
      <td>Entertainer Showcase</td>
      <td>ชมรมสันทนากร </td>
    </tr>
    <tr>
      <td>09:50 - 10:00</td>
      <td>การแสดงคทากร</td>
      <td>คณะคทากรโรงเรียน</td>
    </tr>
    <tr>
      <td>10:00 - 10:10</td>
      <td>การแสดงมู่หลาน</td>
      <td>ชมรมสีสรรพ์ภาษาต่างประเทศที่ 2 ภาษาจีน</td>
    </tr>
    <tr>
      <td>10:10 - 10:15</td>
      <td>การแสดงควงธง</td>
      <td>คัลเลอร์การ์ดสีแสด</td>
    </tr>
    <tr>
      <td>10:15 - 10:30</td>
      <td>K-pop show</td>
      <td>ชมรมสีสรรพ์ภาษาต่างประเทศที่ 2 ภาษาเกาหลี</td>
    </tr>
    <tr>
      <td>10:30 - 10:45</td>
      <td>กิจกรรมสัมภาษณ์รุ่นพี่</td>
      <td>คณะกรรมการกลางงานกิจกรรมพัฒนาผู้เรียน</td>
    </tr>
    <tr>
      <td>10:45 - 10:50</td>
      <td>การแสดงเชียร์เพลงพระราชนิพนธ์</td>
      <td>ชมรมนันทนาการกีฬา</td>
    </tr>
    <tr>
      <td>10:50 - 10:55</td>
      <td>การแสดงควงธง</td>
      <td>คัลเลอร์การ์ดสีบานเย็น</td>
    </tr>
    <tr>
      <td>10:55 - 11:05</td>
      <td>การแสดง Soran</td>
      <td>ชมรมสีสรรพ์ภาษาต่างประเทศที่ 2 ภาษาญี่ปุ่น</td>
    </tr>
    <tr>
      <td>11:05 - 11:10</td>
      <td>การแสดงเชียร์เพลงเราเตรียม</td>
      <td>ชมรมนันทนาการกีฬา</td>
    </tr>
    <tr>
      <td>11:10 - 11:20</td>
      <td>กิจกรรมแนะนำชมรม</td>
      <td>คณะกรรมการกลางงานกิจกรรมพัฒนาผู้เรียน</td>
    </tr>
    <tr>
      <td>11:20 - 11:25</td>
      <td>การแสดงควงธง</td>
      <td>คัลเลอร์การ์ดสีเขียว</td>
    </tr>
    <tr>
      <td>11:25 - 11:35</td>
      <td>Entertainer Showcase</td>
      <td>ชมรมสันทนากร </td>
    </tr>
    <tr>
      <td>11:35 - 11:45</td>
      <td>การแสดง Lation Dance</td>
      <td>ชมรมสีสรรพ์ภาษาต่างประเทศที่ 2 ภาษาสเปน</td>
    </tr>
    <tr>
      <td>11:45 - 14:00</td>
      <td>การแสดงจากชมรมดนตรีสากล</td>
      <td>ชมรมดนตรีสากล</td>
    </tr>
  </React.Fragment>
))

export const Day2 = React.memo(() => (
  <React.Fragment>
    <tr>
      <td>09:30 - 09:50</td>
      <td>Alice in music-land</td>
      <td>ชมรมการ์ตูน</td>
    </tr>
    <tr>
      <td>09:50 - 10:00</td>
      <td>การแสดงเชียร์</td>
      <td>คณะผู้นำเชียร์โรงเรียน</td>
    </tr>
    <tr>
      <td>10:00 - 10:05</td>
      <td>การแสดงควงธง</td>
      <td>คัลเลอร์การ์ดสีม่วง</td>
    </tr>
    <tr>
      <td>10:05 - 10:15</td>
      <td>กิจกรรมสัมภาษณ์รุ่นพี่</td>
      <td>คณะกรรมการกลางงานกิจกรรมพัฒนาผู้เรียน</td>
    </tr>
    <tr>
      <td>10:15 - 10:25</td>
      <td>Entertainer Showcase</td>
      <td>ชมรมสันทนากร</td>
    </tr>
    <tr>
      <td>10:25 - 10:30</td>
      <td>การแสดงควงธง</td>
      <td>คัลเลอร์การ์ดสีเหลือง</td>
    </tr>
    <tr>
      <td>10:30 - 10:50</td>
      <td>แนะนำสายการเรียน คณิตศาสตร์ - วิทยาศาสตร์</td>
      <td>นักเรียนแผนการเรียน คณิตศาสตร์ - วิทยาศาสตร์</td>
    </tr>
    <tr>
      <td>10:50 - 11:20</td>
      <td>Fashion show</td>
      <td>ชมรมนิเทศศิลป</td>
    </tr>
    <tr>
      <td>11:20 - 11:40</td>
      <td>แนะนำสายการเรียน ภาษา</td>
      <td>นักเรียนแผนการเรียน ภาษา</td>
    </tr>
    <tr>
      <td>11:40 - 11:45</td>
      <td>การแสดงควงธง</td>
      <td>คัลเลอร์การ์ดสีฟ้า</td>
    </tr>
    <tr>
      <td>11:45 - 11:55</td>
      <td>French Chorus</td>
      <td>French Chorus</td>
    </tr>
    <tr>
      <td>11:55 - 12:05</td>
      <td>Entertainer Showcase</td>
      <td>ชมรมสันทนากร</td>
    </tr>
    <tr>
      <td>12:05 - 12:10</td>
      <td>การแสดงควงธง</td>
      <td>คัลเลอร์การ์ดสีแดง</td>
    </tr>
    <tr>
      <td>12:10 - 12:25</td>
      <td>กิจกรรมสัมภาษณ์รุ่นพี่</td>
      <td>ชมรมสันทนากร </td>
    </tr>
    <tr>
      <td>12:25 - 14:30</td>
      <td>การแสดงจากชมรมดนตรีสากล</td>
      <td>ชมรมดนตรีสากล</td>
    </tr>
  </React.Fragment>
))
